public	class BitOperator{
public static void main(String[] args){
	//原码反码补码小知识
	//计算机用补码存整数，正数三码相同，负数补码 = 反码+1，为了计算方便，我愿称之为二进制整数大一统
	//位换算
	//8bits一byte int型java默认4bytes 所以二的原码是4*8=32个bit位
	//计算机用补码计算，展示给用户时用的是原码
	//计算时源码-->反码-->补码
	//展示给用户补码-->反码-->源码


	 //位运算 前四个 

    //推导
	//正数2的三码相同 这里是补码计算   00000000 00000000 00000000 00000010
	//正数3的三码相同 这里是补码计算   00000000 00000000 00000000 00000011
  //经过按位&的操作后 全为1才1  否则零 00000000 00000000 00000000 00000010 
	//运算后的补码符号位为零三码一致不用管 ，转成10进制结果是2
	System.out.println(2&3);

	//推导
	//1.先得到-2的原码   10000000 00000000 00000000 00000010
	//2.再得到-2的反码   11111111 11111111 11111111 11111101
	//3.再得到-2的补码   11111111 11111111 11111111 11111110
	//4.按位取反-2操作   00000000 00000000 00000000 00000001 
	//5.运算后就是这个值，因为已经是正数了=>换算之后是十进制1                  
	System.out.println(~-2);
	//推导
	//1.先得到 2的原码   00000000 00000000 00000000 00000010
	//2.再得到 2的反码   00000000 00000000 00000000 00000010 
	//3.再得到 2的补码   00000000 00000000 00000000 00000010
	//4.按位取反 2操作   11111111 11111111 11111111 11111101
	//5.运算后的源码
	//6.对运算后的补码-1得到反码 11111111 11111111 11111111 11111100
	//7.对刚得到的反码除了符号位取反得到原码
	//                         10000000 00000000 00000000 00000011
	//换算成十进制是-3        
	System.out.println(~2);    

	//算数右移>>
	int a = 1>>2;
	//算术右移>>>>>

}
}