public	class BitOperato2{
public static void main(String[] args){
	    //针对位运算符>> << >>>的特殊案例
	    //算数右移>>
		//正数的算数右移>>
		System.out.println(1>>1);
		//三码合一 00000000 00000000 0000000 0000001
	    //右移补零 00000000 00000000 0000000 0000000
	    //得零  
	    //负数的算数右移>>
		System.out.println(-1>>1);
		//得到原码 10000000 00000000 0000000 0000001
		//补码运算 11111111 11111111 1111111 1111111
		//右移补一 11111111 11111111 1111111 1111111
		//得到反码 11111111 11111111 1111111 1111110
		//得到原码 10000000 00000000 0000000 0000001
		//再右移负数的时候，左边补的是1 
		//还是-1对应算数右移-1/2=-0.25，向下取整得-1 
		System.out.println("-1/2/2= "+ -1/2);//但是这里是零
        //总结
        //
        //整数中的算数右移 正数会向0取整（和计算时一致），负数会向-1取整（和计算时不一致）
        //算数左移<<
        //负数
		System.out.println(-1<<2);
		//得到原码 10000000 00000000 0000000 0000001
		//补码运算 11111111 11111111 1111111 1111111
		//右移补零 11111111 11111111 1111111 1111100
		//得到反码 11111111 11111111 1111111 1111011
		//得到原码 10000000 00000000 0000000 0000100
        //十进制4 二进制100 -1还原到反码得 十进制3 二进制011
        //最终运算结果是-4对应算数左移-1*2*2得-4


        //正数
        System.out.println(1<<2);
        //三码合一 00000000 00000000 0000000 0000001
	    //左移补零 00000000 00000000 0000000 0000100
	    //得4


	    //逻辑或者无符号右移>>>（高位总是补零）
	    //负数 
		System.out.println(-1>>>2);
		//得到原码 10000000 00000000 0000000 0000001
		//补码运算 11111111 11111111 1111111 1111111
		//右移补零 00111111 11111111 1111111 1111111
		//已经是正 00111111 11111111 1111111 1111110
		//不补符号而且因为补得是00所以变成正数所以很大的数
		//1073741823  
       
}
}